{"enLang":"EN","headerText2":"End User Seller Associate Certification - Cloud & Service Providers (Colocation): Baseline Assessment","headerText":"End User Sellers Associate Certification - Cloud & Service Providers (Colocation): Baseline Assessment","associateCertification":"End User Sellers Associate Certification ","colocation":" Cloud & Service Providers – Colocation Baseline Assessment ","homeDescription":"You are entering the first milestone of your certification journey: the baseline assessment. This questionnaire is designed to assess your fundamental knowledge required to excel in the Cloud & Service Providers– Colocation segment sales. It aims to assist you in identifying areas for improvement and strengthening your foundational understanding.","privacytitleText":"Privacy Notice","privacynoticeText":"<p>Schneider Electric is a global Company that commits to ensure an adequate level of protection for personal information in compliance with applicable laws.</p><p>In its efforts to protect personal information, Schneider Electric has adopted a Global Data Privacy Policy which imposes common rules for the collection, use and disclosure of personal information by all Schneider Electric entities globally and aims at ensuring the protection of personal information within the Company. The Global Data Privacy Policy is available on Spice+</p><p>In the framework of <b>End User Sellers Associate Certification Program</b>, personal information is processed for the following purposes:</p><ul><li>To help you explore and identify your strengths and areas of improvement.</li><li>To provide you with learning recommendations.</li><li>To track and visualize progress and score evolution for upskilling.</li><li>To allow you to attend the learning workshops which will follow (virtual / physical) to complete the certification program.</li><li>To generate reports aggregating data for analytics & dashboarding.</li><li>To send you email communications and reminders so you can easily come back and keep learning.</li></ul>","assessmentInstructionsTitle":"Assessment Instructions","assessmentInstructions":"<p>This assessment marks the first step of the learning program. It is designed to evaluate your knowledge and identify potential gaps in 5 sections: Segment, EcoStruxure domain, 3S (Sustainability, Software & Services), Sales skills and Sales tools & processes.</p><ul><li>The passing grade for the assessment is 65% or above for the whole assessment and for each of the 5 sections.</li><li>Each section will be graded separately.</li><li>Please ensure a stable internet connection and a quiet environment to take the assessment without interruptions.</li><li>The duration of the assessment is estimated to be 1 hour, and you will have an option to pause in-between the sections and continue. However, it is recommended that you free up your calendar to dedicate the next 1 hour to complete the assessment in one go.</li></ul><p>We wish you the best of luck as you undertake this foundational assessment. Click Begin once you are ready.</p>","continue":"Continue","agreeAndContinue":"Agree & Continue","begin":"Begin","Close":" Close","segment":"Segment","domain":"EcoStruxure Domain","software":"Sustainability, Software & Services","sales":"Sales Skills","tools":"Sales Tools & Processes","segmentDesc":"<p>The overarching knowledge of Cloud & Service Providers (Colocation) segment is key to the success in your role as it helps you uncover your customers business and how we at Schneider Electric can help them. The questions in this section would explore:</p><ul><li>Our segment customers business, industry trends and value chain players.</li><li>Segment Value proposition, key differentiating points of our main offers and EcoStruxure architecture.</li><li>Better understanding of how to engage Customers into value-driven interaction to jointly quantify the impact of Schneider Electric solutions.</li></ul>","domainDesc":"<p>The overarching knowledge of the EcoStruxure domains relevant to Cloud & Service Providers (Colocation) segment is key to the success of your role as it helps you uncover EcoStruxure offer and the business benefits it brings to our customers.</p><p>The questions in this section will focus across EcoStruxure Power and Building offer overview, key customer questions and persona benefits.</p><ul><li>Understanding EcoStruxure Power architecture layers and value proposition</li><li>Knowledge of the key customer personas for EcoStruxure Power</li><li>Awareness of technology trends driving changes in the Power market</li></ul>","softwareDesc":"<p>This section focuses on the three (3S) key pillars of our Equity story and strategy - Sustainability, Software & Services.</p><p>The questions are curated to check your understanding of customer priorities, pitching the advanced support levels, consulting opportunities and remote monitoring, offering a comprehensive understanding of our cutting-edge 3S capabilities.</p>","salesDesc":"<p>The questions in this section focus on the concepts of Consultative Selling Approach & Sprint Negotiations to ensure you master the critical structure of a sales conversation and engage in successful, buyer-focused dialogue & value-based relationship approach.</p><p>While all answers are in principle correct, we are looking for the best fit answer to reward you a point.</p>","toolsDesc":"<p>The questions in this section focus on Sales<br> Tools and Processes to make your sales <br>preparation and conversations more <br>efficient and replicable.</p>","mainBenefitQuestion":"What is the main benefit of platforms and microservices in software architecture?","submit":"Start","submit1":"Submit","s1q1":"Which of the below describes the value proposition of the C&SP Segment?","s1q1option1":"Provide unique domain expertise in Building, Power and IT to help clients in their sustainable and digital journey through all phases of the facility - design, build, operate, maintain.","s1q1option2":"Transform operations to improve factory productivity while increasing flexibility with our smart manufacturing solutions.","s1q1option3":"Reduce environmental footprint and increase efficiency to make sure your production environment is safe, available, efficient and green.","s1q2":"Who are the competitors in the C&SP Market?","s1q2option1":"Johnson Controls","s1q2option2":"Siemens","s1q2option3":"ABB","s1q2option4":"GE Digital","s1q3":"What are the Colocation market trends? (SELECT ALL THAT APPLY)","s1q3option1":"Cloud computing, AI, Digital Advertising are growing 2 digits","s1q3option2":"Race between Europe and MEA for tech supremacy","s1q3option3":"Market growing West to East also moving to new markets (SAM/MEast/EAJ)","s1q3option4":"Hyperscale self build is still a market driver (48% worload by 2023)","s1q4":"Please select Colocation key needs. (SELECT ALL THAT APPLY)","s1q4option1":"Sustainable (renewable energy, efficiency, improved PUE)","s1q4option2":"Optimized (Improved Cost of ownership across Capex & Opex phases, consistent designs for speed of deployment)","s1q4option3":"Flexible Adaptable (able to support different work loads and densities across multiple geographical regions)","s1q4option4":"Reliable (reduce vulnerability to unplanned downtime)","s1q5":"What is the most efficient cooling technology?","s1q5option1":"Air Cooled Chiller with free cooling","s1q5option2":"Water Cooled Turbocor Chiller","s1q5option3":"Depends on climate condition, size of the project and profile of the IT load","s1q5option4":"Fanwall with Air free-cooling Chiller","s1q6":"How can we support Design & Construction personas reach their goals? (SELECT ALL THAT APPLY)","s1q6option1":"Use proven methodologies and experienced engineering team to deliver consistent experience without compromising business, sustainability and solution performance","s1q6option2":"Start with the WHY to make informed decisions and set starting points from the company business perspective","s1q6option3":"Digitize the planning, design and construction process to enhance productivity and de-risk deployment","s1q6option4":"Wait for the RFI to be issued before any contact","s1q7":"How would you say Schneider Electric contributes to the customer sustainability journey?  (SELECT ALL THAT APPLY)","s1q7option1":"By establishing a sustainable actionable strategy in order to reach defined goals","s1q7option2":"Doing nothing is a good idea - keep going and let others waste time and money","s1q7option3":"By enabling analysis and reporting with open platform \"EcoStruxure Resource Advisor\"","s1q7option4":"SE differentiates itself by being a leader in sustainability while delivering sustainable solutions","s1q8":"When managing DC uptime and SLAs, what is of great help to the Operation department?  (SELECT ALL THAT APPLY)","s1q8option1":"Start with global standards establishing quality design, installation, commissioning, testing and operating","s1q8option2":"Implement and use continuous monitoring (Amp,T°,Humidity,etc.) capabilities for grey and white space","s1q8option3":"Use reports and predictive insights to help maintain software and hardware (including health index)","s1q8option4":"Rely on design robustness","s1q9":"Why is EcoStruxure messaging so important for the segment? Choose one proposition:","s1q9option1":"EcoStruxure can bring an end to end solution to our customers, giving visibility to their complete architecture while providing value insights for optimal operations. (from Design to Building to Operation and Maintenance)","s1q9option2":"Because it brings directly increase in revenue","s1q9option3":"Because it helps to create safety","s1q9option4":"None of the options","s1q10":"Why is it important to elaborate needs and technical requirements? (SELECT ALL THAT APPLY)","s1q10option1":"To help customers define their own needs and objectives and prioritize","s1q10option2":"To step back and break down performances","s1q10option3":"To develop exhaustive views and scope of the problem to solve","s1q10option4":"To create collaborative approach and facilitate solving complex problem","s1q11":"Why it is better to engage earlier, at higher level, with peers and ecosystem?  (SELECT ALL THAT APPLY)","s1q11option1":"It helps to better support and influence decision maker","s1q11option2":"It contributes to challenging client thinking to set the most adapted starting points","s1q11option3":"It helps to expand SE scope of work","s1q11option4":"It simplifies the relationship by orchestrating a comprehensive solution team","s1q12":"When we see priorities such as 1st Cost, Scalability, Reliability, Operational Excellence, Time to Market, which of the following customers can you best relate their needs to?","s1q12option1":"Small data center (<500kW)","s1q12option2":"Medium Colocator","s1q12option3":"Large Colocator","s1q12option4":"Hyperscale Customer","s1q13":"How can we define a flexible design for a data center?","s1q13option1":"Right-size products for optimized efficiency","s1q13option2":"Based on the customers business plan, develop a design with various options of total sqm, power, rack density, and future growth.","s1q13option3":"Build different size (sqm) of IT rooms","s1q13option4":"Scale with OCP racks only","s1q14":"Considering EcoStruxure Building Operation used as \"umbrella\" of the management system, where is it well adapted for?","s1q14option1":"Small Colocation data center (<500kW)","s1q14option2":"Medium Colocation data center (between 500kW to 5MW)","s1q14option3":"XL Colocation data centers (from 20MW)","s1q15":"Which of the following statements are false when considering requirements of our maintenance and service offers?","s1q15option1":"Multi-country maintenance with guaranteed SLAs is interesting for Large Colo players","s1q15option2":"Medium colocators are requesting more and more services from vendors","s1q15option3":"Cybersecurity is part of Schneider Electric service activities","s1q15option4":"SF6 recovery must be managed by other players than Schneider Electric services","s1q16":"Please identify most important stakeholders part of new build (green field) decision process.  (SELECT ALL THAT APPLY)","s1q16option1":"Consultant-Design Office (third party)","s1q16option2":"Facility provider (third party)","s1q16option3":"General management (Colo operator)","s1q16option4":"Design & Engineering","s1q17":"Choose among the following statements those that refer to C&SP strategy.  (SELECT ALL THAT APPLY)","s1q17option1":"Leverage all our capabilities with industry leaders to build, deploy and operate custom but repeatable DCInfrastrture anywhere in the world","s1q17option2":"Engaging at every phase of the life cycle (from Capex to Opex cycle)","s1q17option3":"Leverage learnings from our most challenging clients to drive simplicity throughout the Industry","s1q17option4":"Engage only with US and China players","s1q18":"Please select Colocation key needs.","s1q18option1":"Sustainability (scale your business without compromise for future generation)","s1q18option2":"Efficient (Optimize cost,  speed,  Return On Investment)","s1q18option3":"Adaptative (accomodate new technology with futur-proof designs)","s1q18option4":"Resilient (reduce vulnerabilit to unlanned downtime)","s1q19":"Does Distributed redundant vs. 2N Electrical architecture contribute to the sustainability goals of XLarge data centers?","s1q19option1":"Yes","s1q19option2":"No","s1q20":"When managing DC uptime and SLAs, what is of great help to the Operation department?  (SELECT ALL THAT APPLY)","s1q20option1":"Start with global standards establishing quality design, installation, commissioning, testing and operating","s1q20option2":"Implement and use continuous monitoring (Amp,T°,Humidity,etc.) capabilities for grey and white space","s1q20option3":"Use reports and predicitive insights to help maintain software and hardware (including health index)","s1q20option4":"Rely on design robustness","s1q21":"Select the best approach to provide future proof designs and increased speed to market.","s1q21option1":"By using cheapest products from vendor list","s1q21option2":"By using best of breed products","s1q21option3":"By using best of breed products, modular solutions, and integrated Software","s1q21option4":"By using best of breed & sustainable products, modular solutions, integrated Software, and Site services","s1q22":"How can we help improve productivity/simplicity/cost optimization without compromise to system availability, reliability and energy efficiency? Choose the ones that fit the best.  (SELECT ALL THAT APPLY)","s1q22option1":"Engage with your customer on a DBOM journey","s1q22option2":"Deploy end-to-end digital toolset, integrated software and digital apps (design, build,operate and maintain) in conjunction with Engineering teams","s1q22option3":"Focus on product presentation, proprietary digital platforms, and colocation operation team when RFI comes out","s1q23":"Which of the following statements can be instrumental to tenants experience enhancement? (SELECT ALL THAT APPLY)","s1q23option1":"Provide visibility and transparency down to the critical IT load thanks to open digital platform.","s1q23option2":"Provide Advanced custom reports and services for tenant leased area (white space).","s1q23option3":"Rely on, multiple proprietary software's and stakeholders, to have best insights","s1q23option4":"Reduce number of manual operation and lack of visibility","s1q24":"How to reach operational excellence? (SELECT ALL THAT APPLY)","s1q24option1":"Implement a global service framework that relies on robust core principles (design, architecture, connectivity and standards)","s1q24option2":"Rely on 3-party maintains providers and annual RFP","s1q24option3":"Allow visibility and remote support everywhere anytime","s1q24option4":"Integrate Cyber risk assessments into regular procedures","s1q25":"In which departments do key C&SP personas sit? (SELECT ALL THAT APPLY)","s1q25option1":"Technical departments (Operation / Design & Eng / Construction..)","s1q25option2":"Human Resources department","s1q25option3":"Business departments (Sales / Marketing)","s1q25option4":"Finance department","s2q1":"What are the elements of the EcoStruxure Power Value Proposition?","s2q1option1":"Design/Build/Commission Efficiency, Electrical Safety, Power Availability, Operational Efficiency, Sustainability, Cybersecurity","s2q1option2":"Connected Products, Edge Control, Advisors, Services","s2q1option3":"EcoStruxure Power Monitoring Expert, EcoStruxure Power Operation, EcoStruxure Power Automation System","s2q1option4":"Cybersecurity, IoT, Efficiency, Edge Control","s2q2":"Who were the Customers Personas we had in mind when creating the EcoStruxure Power offer?(SELECT ALL THAT APPLY)","s2q2option1":"Panel Builders & Digital Power Management System Integrators","s2q2option2":"EPCs, General and Electrical Contractors","s2q2option3":"Service Providers/Facility Management Contractors/End Users","s2q2option4":"Design Consultants/Firms","s2q3":"Which of the following are part of the Apps, Analytics & Services layer of the EcoStruxure Power offer? (SELECT ALL THAT APPLY)","s2q3option1":"Digital Services","s2q3option2":"EcoStruxure Power Advisor","s2q3option3":"Cybersecurity services","s2q3option4":"EcoStruxure Workplace Advisor","s2q4":"Which of the following are included in the Key Questions for our Power customers?  (SELECT ALL THAT APPLY)","s2q4option1":"How many PowerLogic meters do you want to buy?","s2q4option2":"Have you experienced any electrical safety events that have impacted your operations?","s2q4option3":"What are your customer's expectations as it relates to sustainability?","s2q4option4":"How familiar are you with digital technology and its potential benefits in the context of electrical system design?","s2q5":"Which of the following statements about EcoStruxure Power are True? (SELECT ALL THAT APPLY)","s2q5option1":"EcoStruxure Power strives to make power available 24/7 without compromise.","s2q5option2":"EcoStruxure Power transforms electrical safety by eliminating people and asset incidents.","s2q5option3":"EcoStruxure Power delivers predictive, condition-based information and real-time situational awareness of the entire power system, to provide actionable business intelligence and improve maintenance effectiveness","s2q5option4":"EcoStruxure Power strives helps to eliminate cyber security intrusions that affect operations","s2q6":"Which of the following are Key Technology Trends driving changes in the Power market?  (SELECT ALL THAT APPLY)","s2q6option1":"Sustainability","s2q6option2":"Power Availability","s2q6option3":"Cybersecurity","s2q6option4":"Design/Build/Commission Efficiency","s2q7":"Which of the following are part of the Connected Products layer of the EcoStruxure Power offer? (SELECT ALL THAT APPLY)","s2q7option1":"Resource Advisor","s2q7option2":"Low Voltage Switchgear, Switchboards and Motor Control","s2q7option3":"Medium Voltage Transformers & Switchgear","s2q7option4":"Power Quality, Power Factor & Secure Power","s2q8":"Which of the following are part of the Edge Control layer of the EcoStruxure Power offer?  (SELECT ALL THAT APPLY)","s2q8option1":"EcoStruxure Panel Server","s2q8option2":"EcoStruxure Process Operation","s2q8option3":"EcoStruxure Power Operation","s2q8option4":"EcoStruxure Power Monitoring Expert","s2q9":"EcoStruxure Power enables Consultants to design faster while ensuring high availability power system designs that leverage digital technology for building owners and operators to ensure electrical safety, maximize power availability, improve sustainability and operational efficiency, whilst remaining resilient to evolving cyber threats.","s2q9option1":"True","s2q9option2":"False","s2q10":"Which of the following are true statements regarding the BASF case study?  (SELECT ALL THAT APPLY)","s2q10option1":"Their EcoStruxure Solution is being used to assess the health of electrical distribution equipment, motor control centers, and motors","s2q10option2":"The Beaumont site is part of BASF's agricultural business","s2q10option3":"Asset Advisor and the Schneider Connected Service Hub are being used to prevent catastrophic failures","s2q10option4":"BASF is the largest chemical company in the world","s2q11":"What are the 4 elements of the EcoStruxure Building Value Proposition?","s2q11option1":"Connected Room Solution, Building Advisor, SpaceLogic, Field Services","s2q11option2":"Sustainable, Hyper-Efficient, People-Centric, Resilient","s2q11option3":"Cybersecurity, IoT, Efficiency, Edge Control","s2q11option4":"Cybersecurity, Building Advisor, Compliance, Flexibility","s2q12":"Which of the following are part of the Apps, Analytics & Services layer of the EcoStruxure Building offer? (SELECT ALL THAT APPLY)","s2q12option1":"EcoStruxure Microgrid Advisor","s2q12option2":"EcoStruxure Engage Enterprise App","s2q12option3":"EcoStruxure ADMS","s2q12option4":"EcoStruxure Building Advisor","s2q13":"Which of the following are included in the Key Questions for our Buildings customers?  (SELECT ALL THAT APPLY)","s2q13option1":"How do you manage your assets and building needs currently? What advantages do you see with a proactive versus reactive system?","s2q13option2":"Would you like to see our new SpaceLogic Valves & Actuators?","s2q13option3":"What is your building or company's plan to achieve energy efficiency, sustainability, or other environmental goals?","s2q13option4":"What are you doing to future-proof your investments to maintain value and relevance over the lifecycle of your building?","s2q14":"Which of the following are Key Trends driving the Buildings of the Future? (SELECT ALL THAT APPLY)","s2q14option1":"Industrialization","s2q14option2":"Digitization, Data Analytics, and Services","s2q14option3":"Enterprise Services at Scale","s2q14option4":"Modernization and Future Proofing","s2q15":"Which of the following statements about System Integrators are True? (SELECT ALL THAT APPLY)","s2q15option1":"They are looking for tried, tested, innovative solutions which meet specifications, provide differentiation from other suppliers, and allow them to increase the scope they can provide.","s2q15option2":"They need to be able to deliver these solutions in the most cost effective way by reducing design, installation, and commissioning costs.","s2q15option3":"They are looking to increase the Asset value by making their buildings more marketable and attractive to tenants, and by making spaces flexible and able to be repurposed for a variety of different uses.","s2q15option4":"They are looking for operational efficiency, reduced costs, and occupant well-being, whilst gaining insight into what the building is doing, where the problem areas are.","s2q16":"Which of the following are part of the Connected Products layer of the EcoStruxure Building offer? (SELECT ALL THAT APPLY)","s2q16option1":"SpaceLogic Valves & Actuators","s2q16option2":"Smart Ring Main Unit","s2q16option3":"Connected Room Solution","s2q16option4":"SpaceLogic Sensors","s2q17":"Which of the following are part of the Edge Control layer of the EcoStruxure Building offer?  (SELECT ALL THAT APPLY)","s2q17option1":"EcoStruxure Advanced Metering Operation","s2q17option2":"EcoStruxure Security Expert","s2q17option3":"EcoStruxure Microgrid Operation","s2q17option4":"EcoStruxure Building Operation","s2q18":"Is this statement True or False? 'EcoStruxure Building allows Facility Managers to better deploy their resources in a more effective manner, lowering their operating costs, and allowing their building to be better managed and perform better for the owners.'","s2q18option1":"True","s2q18option2":"False","s2q19":"The Open Innovative Platform enables Buildings to: integrate and connect to more devices, adapt to changing layouts and expansion needs, and evolve continuously to provide more efficiency, more comfort and best-in-class occupant experience. Which value in the value proposition are we describing?","s2q19option1":"Maximizing the efficiency of Buildings","s2q19option2":"Optimize comfort and productivity for Occupants","s2q19option3":"Increasing the value of Buildings","s2q20":"Which of the following statements about EcoStruxure Building are True? (SELECT ALL THAT APPLY)","s2q20option1":"EcoStruxure Building maximizes building efficiency, optimizes comfort and productivity, and increases building value","s2q20option2":"EcoStruxure Building allows Facility Managers to better deploy their resources in a more effective manner, lowering their operating costs, and allowing their building to be better managed and perform better for the owners.","s2q20option3":"EcoStruxure Building is The Open Innovation Platform for buildings","s2q20option4":"EcoStruxure Building allows System Integrators to become more competitive, by reducing design, installation, and commissioning costs.","s2q21":"What is the biggest challenge Data Center customers are facing today?","s2q21option1":"To make data centers Resilient, Secure and Sustainable","s2q21option2":"To make data centers hybrid","s2q21option3":"To manage data centers infrastructures","s2q21option4":"None of these options","s2q22":"What are the trends in the market that drive the strategic importance for DCIM?","s2q22option1":"Rising Resiliency Requirements","s2q22option2":"Cybersecurity TOPS the list of concerns","s2q22option3":"Sustainability is BUSINESS","s2q22option4":"None of these options","s2q23":"How many waves of evolution DCIM have?","s2q23option1":"Three","s2q23option2":"Four","s2q23option3":"Five","s2q23option4":"None","s2q24":"EcoStruxure IT helps address the challenges customers face in Data Centers.","s2q24option1":"True","s2q24option2":"False","s2q25":"What are the different offers EcoStruxure IT solution has to address the Data Center customer needs?","s2q25option1":"EcoStruxure IT Advisor","s2q25option2":"EcoStruxure IT Expert","s2q25option3":"Data Center Expert","s2q25option4":"NetBotz","s2q25option5":"All of these options","s3q1":"What is a core principle of consultative selling?","s3q1option1":"Quickly establishing credibility by listing key product differentiating features","s3q1option2":"Positioning your product as the superior solution as soon as a competitor challenge is identified","s3q1option3":"Moving to pricing early to ensure budget alignment","s3q1option4":"Structuring conversations around open-ended questions to uncover underlying need","s3q2":"What is the best way to structure a discovery conversation?","s3q2option1":"Begin with a high-level overview of your solution before addressing client challenges","s3q2option2":"Guide the conversation by asking progressively deeper questions about their priorities","s3q2option3":"Focus on uncovering budget constraints before discussing value propositions","s3q2option4":"Present an industry case study to demonstrate expertise, then ask about their needs","s3q3":"Which of the following is the most effective response to a price objection?","s3q3option1":"Offer a competitive pricing early enough to remove pricing as a barrier and demonstrate a collaborative approach","s3q3option2":"Compare your pricing against competitors to justify your position","s3q3option3":"Acknowledge the concern and shift the conversation toward long-term ROI","s3q3option4":"Reiterate why your product offers the best features of the market","s3q4":"An agile sales methodology that is highly responsive to change focuses on:","s3q4option1":"Maximizing speed by skipping unnecessary discussions","s3q4option2":"Identifying and accelerating key decision points to drive efficient deal closure","s3q4option3":"Using standardized presentations to create consistency across sales cycles","s3q4option4":"Prioritizing customer relationships over deal velocity","s3q5":"Which approach is most effective in Negotiation?","s3q5option1":"Leading with your final offer to establish firm boundaries","s3q5option2":"Presenting multiple pricing options early to gauge client interest","s3q5option3":"Balancing strategic flexibility with a focus on mutual value creation","s3q5option4":"Holding firm on pricing until the client asks for a concession","s3q6":"When a client says they are satisfied with their current provider, what is the best response?","s3q6option1":"Move on and check in again in the next sales cycle","s3q6option2":"Ask probing questions to understand what they value and where potential gaps exist","s3q6option3":"Immediately offer a competitive price to encourage switching","s3q6option4":"Focus on how your solution offers superior functionality and quality","s3q7":"Which of the following best defines active listening in sales?","s3q7option1":"Waiting until the client has finished speaking before preparing your next question","s3q7option2":"Summarizing key points and confirming understanding before responding","s3q7option3":"Nodding and maintaining eye contact while letting them explain their concerns","s3q7option4":"Restating exactly what the client says to show engagement","s3q8":"When engaging multiple stakeholders in a deal, what should be your priority?","s3q8option1":"Addressing individual concerns while ensuring strategic alignment across teams","s3q8option2":"Focusing on the most senior decision-maker and tailoring your pitch to them","s3q8option3":"Assuming that the internal champion will advocate for you effectively","s3q8option4":"Keeping the discussion high-level to appeal to a broad audience","s3q9":"What is the most effective way to present a solution in a consultative sales conversation?","s3q9option1":"Provide an in-depth feature breakdown to showcase the technical advantages","s3q9option2":"Demonstrate how the solution directly addresses the client’s stated priorities and challenges","s3q9option3":"Position the solution as the best option compared to competitors","s3q9option4":"Focus on closing quickly by presenting a limited-time offer","s3q10":"Why is it important to reframe objections during sales conversations?","s3q10option1":"To show confidence by countering their concern with strong evidence","s3q10option2":"To shift their focus from a barrier to the broader value proposition","s3q10option3":"To move past the objection quickly and keep the conversation progressing","s3q10option4":"To challenge their concerns and demonstrate thought leadership","s3q11":"Scenario: The client expresses interest but says they 'need more time to decide.'","s3q11option1":"Suggest scheduling another meeting to follow up","s3q11option2":"Ask what additional information they need and propose next steps","s3q11option3":"Offer a discount if they commit today","s3q11option4":"Reassure them that they can take their time and reach out when ready","s3q12":"Scenario: A prospect is reluctant to switch providers because 'changing is too complicated.'","s3q12option1":"Demonstrate how your solution minimizes disruption and offer conversion support","s3q12option2":"Provide a direct cost comparison with their current provider","s3q12option3":"Offer a free trial period to remove their concerns","s3q12option4":"Argument by emphasizing the risks of staying with their current solution","s3q13":"Scenario: A procurement team is pushing for a discount.","s3q13option1":"Request to revisit pricing once they are ready to commit to ensure you do not erode your pricing","s3q13option2":"Offer a small price reduction to maintain goodwill and stay in the race","s3q13option3":"Shift focus to long-term value and ROI instead of pricing based on your understanding of their objectives","s3q13option4":"Hold firm on price and decline to negotiate further until they are ready to finalize","s3q14":"How would you handle an uncertain buyer?","s3q14option1":"Ask what concerns are holding them back and address them","s3q14option2":"Push for a decision now to avoid further delays","s3q14option3":"Offer a limited-time discount as an incentive","s3q14option4":"Accept their hesitation and check in next quarter","s3q15":"When considering how to address a client's business problem, what should you ask yourself first?","s3q15option1":"What is the revenue potential for my company?","s3q15option2":"Does it fit my company's criteria for a strategic opportunity?","s3q15option3":"Is this a competitive opportunity?","s3q15option4":"Who are the decision-makers and can I reach them?","s3q16":"How would you evaluate the strength of your relationship with a client?","s3q16option1":"Their past involvement in major initiatives and the extent of their support to the success of the joint initiative","s3q16option2":"Our past interactions and their purchase history with our organization","s3q16option3":"The number of meetings we've had in the past","s3q16option4":"Acceptance of invitation to our events","s3q17":"How would you overcome a client’s fear of change?","s3q17option1":"Offer a structured transition plan with minimal disruption","s3q17option2":"Show examples of successful customer transitions","s3q17option3":"Focus on the risks of staying with their current provider","s3q17option4":"Recommend a phased implementation approach","s3q18":"A prospect says, 'We've lost 5% market share, and we need you to show us how to fix it!' How will you respond?","s3q18option1":"To emphasize the problem and the value of our solution, I will ask how the market share loss has impacted other key stakeholders in the organization.","s3q18option2":"I will start outlining the solution and ask how many users are involved, confident it will solve their problem.","s3q18option3":"Since I believe I can resolve their market share issues, I will qualify the opportunity by asking if there is a pre-approved budget for this project.","s3q18option4":"Even if I am sure I can fix their issues, I will first diagnose the problem and ask what is causing the market share loss. Only then will I explain how we can help.","s3q19":"Your customer has just explained what she thinks will solve her business problem. You know from experience that her idea is incomplete and won't fully resolve the issue. What will you do next?","s3q19option1":"To avoid delaying the deal, I will agree with her and wait for her to realize the solution is incomplete before suggesting additional capabilities.","s3q19option2":"I will confirm I can provide the solution as described and then ask questions to make her consider additional capabilities she might need.","s3q19option3":"First, I will build credibility by sharing stories of how I've helped other customers. Then, I will tactfully explain how she can enhance her solution to meet her goals.","s3q19option4":"To avoid offending her, I will tentatively agree with her idea and ask to speak with others in the organization affected by the issue, so I can suggest improvements to the solution based on their input.","s3q20":"A long-time, profitable customer has proposed a solution idea that costs more than the value of the business issue they are trying to address. What do you do?","s3q20option1":"Since this is an existing customer, I will seek approval to lower my price to align the final cost with the customer's perceived value.","s3q20option2":"I will identify others in the organization who could benefit from the solution and use their input to increase the solution's value for the customer.","s3q20option3":"I will collaborate with the customer to remove non-essential parts of the solution to bring down the cost.","s3q20option4":"I will look for additional business problems that my offerings could solve to increase the overall value.","s3q21":"You are involved in a highly competitive deal where the customer recognizes the value and uniqueness of your solution. You have been asked to attend a meeting to negotiate the final agreement and expect pressure on the price. How will you prepare for the meeting?","s3q21option1":"I will seek management approval for the maximum discount and plan to offer it gradually during negotiations.","s3q21option2":"To strengthen my negotiating position, I will prepare responses to discount requests based on 1) the value we bring to the customer and 2) our differentiators.","s3q21option3":"I will prepare to offer non-pricing concessions that the customer will value but will not cost my organization much.","s3q21option4":"I will prepare to offer non-pricing concessions, along with a list of what I would like to receive from the customer in return for those concessions.","s3q22":"Your solution has been selected, and you are invited to final negotiations with the Procurement Officer. They request a 10% price reduction, stating the project can't be funded without it. You have the authority to grant this discount. How would you respond?","s3q22option1":"I will say, 'If I agree to this price cut, can we start immediately?'","s3q22option2":"I will say, 'Our project plan, approved by your senior executives, states the implementation should begin on Monday. This request will cause delays. Is this acceptable?'","s3q22option3":"I will say, 'I can provide a discount if you can also do something for me,' (e.g., expedite the purchase order release due to the tight project schedule).","s3q22option4":"I will say, 'I can lower the price as requested, but we need to discuss how to adjust the scope of the deal.'","s3q23":"You want to secure a meeting with a senior executive at a potential account. You haven't met this executive, but you are familiar with their organization, strategic goals, and have some contacts in the company. How would you start a dialogue with the executive?","s3q23option1":"Send an email with a brief message about how you've helped others in his organization solve their business issues, then call to follow up.","s3q23option2":"Send an email with a short message about how you've helped others in his organization solve their business issues, stating that you will follow up with a call in a few days.","s3q23option3":"Use your contacts in the company to find someone credible with the executive who can make an introduction for you.","s3q23option4":"Follow the executive on social media and join discussion groups they are in to identify the business issues that concern them, using this information to establish a connection.","s3q24":"A senior decision-maker views your offering as a commodity and plans to make a decision based on price. How would you differentiate yourself to reduce pricing pressure?","s3q24option1":"I will not try to differentiate my offering since he sees no difference. Instead, I will work with my manager to secure a competitive price.","s3q24option2":"Since he sees no difference in my product, I will explore other ways to stand out, such as offering creative terms and conditions.","s3q24option3":"I will present third-party research and case studies that demonstrate the superiority of my offerings.","s3q24option4":"I will agree with him and discuss other ways we can add value to his organization.","s3q25":"The decision-maker in your client's organization is in favor of your solution but is worried because this is their first time purchasing this type of solution, and they lack expertise in evaluating and implementing it. How would you address his concerns?","s3q25option1":"I will request to work with their implementation team and help them create an implementation plan.","s3q25option2":"I will ask the decision-maker to outline his concerns so I can address each one.","s3q25option3":"I will propose creating a joint evaluation and implementation plan for the project.","s3q25option4":"I will provide the decision-maker with access to our reference accounts who have successfully implemented this solution.","s3q26":"Your customer is doubtful about the value analysis you presented due to recent projects with lower-than-expected returns. What steps would you take to alleviate his concerns?","s3q26option1":"I will propose creating an evaluation plan that includes: 1) all required capabilities and 2) proof steps on how we can deliver these capabilities. Additionally, I will assure him that my price will stay within his budget.","s3q26option2":"I will suggest the following steps: 1) submit a draft proposal; 2) meet with the decision-maker and all key stakeholders to address everyone's concerns; 3) submit a final proposal after addressing all concerns.","s3q26option3":"I will recommend developing an evaluation plan together, outlining: 1) how our solution meets their business needs; 2) how our company will support them through implementation;","s3q26option4":"I will suggest meeting with key stakeholders to ensure our solution addresses their business needs satisfactorily. Additionally, I will work with the implementation team to scope out the work required to avoid hidden costs and delays during implementation.","s3q27":"You received a verbal agreement for a large contract. Three days later, your prospect informs you that budget cuts prevent them from honoring the agreement. How would you respond?","s3q27option1":"I will ask, 'How significant are the budget cuts?' If I can accommodate the amount needed, I will offer to lower my price, but only if they sign the deal today.","s3q27option2":"I will ask, 'How significant are the budget cuts?' then suggest adjusting the project's scope to fit the new budget.","s3q27option3":"I will express empathy and propose reengaging when their budget situation improves.","s3q27option4":"I will aim to salvage the deal by emphasizing the value our solution brings to the customer's organization. I will recommend mutual concessions to address the budget cutback.","s3q28":"You have been asked to respond to a Request for Proposal (RFP) with a live presentation to a small buying committee. How will you prepare for the live response?","s3q28option1":"I will provide copies of my presentation slides to each committee member and thoroughly review each slide during the presentation to ensure everyone understands our response.","s3q28option2":"To stand out from the competition, I will not prepare slides but will create a detailed document. During the presentation, I will go through each page with the committee members and answer questions as they arise.","s3q28option3":"I will create high-level slides with minimal information and use them, along with other visual aids, to start a conversation with the committee members. I will prepare back-up slides with additional details in case more information is needed.","s3q28option4":"To help the committee understand my proposal without boring them, I will prepare two sets of documents: high-level presentation slides and a detailed proposal. During the presentation, I will use the slides and suggest they follow along with the detailed proposal.","s3q29":"A prospect has already shared their key business issues with you. In your next meeting, you aim to showcase the unique value your offering can bring. How will you prepare?","s3q29option1":"I will get ready to highlight the distinctive features of my offering.","s3q29option2":"I will review recent market data and focus on what sets me apart from competitors.","s3q29option3":"I will draft questions to better grasp the scope of the issue, so I can show how my offerings provide maximum value.","s3q29option4":"I will prepare questions that emphasize my unique strengths.","s3q30":"You received an email from a prospect asking for a meeting to discuss pricing for your company's latest product. The email includes the time, location, product of interest, and the sender's name and title. From a planning perspective, what do you already know, and what else do you need to find out before the call?","s3q30option1":"I know they are likely in the evaluation stage of their buying process, but I don’t know who will be at the meeting, so I need to ask for that information while planning.","s3q30option2":"I think they are early in the buying process since they are asking for pricing, but I don’t know what specific features they need. I will ask for this information to prepare the quote.","s3q30option3":"I know they are probably in the evaluation stage of their buying process, but I don’t know the main business issues they are facing. I will ask about these issues before the call.","s3q30option4":"I suspect they are early in the buying process since they are requesting pricing, but I don’t know what specific features they need. I will ask for this information to prepare the quote.","s3q31":"You've been invited to pursue an opportunity where the requirements seem biased towards a competitor. You decide to meet with the prospect to clarify the requirements. What will you discuss?","s3q31option1":"I will inquire about the business reasons behind these requirements.","s3q31option2":"I will highlight my credentials and explain why I believe the requirements are lacking.","s3q31option3":"I will discuss with the prospect what they hope to achieve by implementing this solution.","s3q31option4":"I will suggest additional requirements that would benefit the customer and set me apart from the competition.","s4q1":"What are the two main categories of software?","s4q1option1":"Hardware and Firmware","s4q1option2":"Applications and System Software","s4q1option3":"Networking Software and Utility Software","s4q1option4":"Algorithms and Compilers","s4q2":"Which assertion about IaaS (Infrastructure as a Service) below is true?","s4q2option1":"It increases local hardware requirements","s4q2option2":"It reduces the need for on-premises IT infrastructure and system software licenses","s4q2option3":"It requires more extensive in-house IT teams","s4q2option4":"It focuses on enhancing physical computing and networking infrastructure performance","s4q3":"Which assertion about SaaS (Software as a Service) below is true?","s4q3option1":"SaaS is about hosting software on local servers; it's less flexible than traditional software deployment","s4q3option2":"SaaS focuses on customizing software for individual needs; it's more costly than traditional software deployment","s4q3option3":"SaaS requires purchasing software licenses; it's less scalable than traditional software deployment","s4q3option4":"SaaS involves accessing ready-to-use software via the cloud; it reduces the need for local installations","s4q4":"What new role does Artificial Intelligence play in the new generation of software applications?","s4q4option1":"It replaces manual processes with automated routines","s4q4option2":"It provides new insights and predictive capabilities","s4q4option3":"It focuses on hardware improvements","s4q4option4":"It simplifies software installation and management","s4q5":"What is the significance of microservices architecture in modern software solutions?","s4q5option1":"It consolidates all functions into a single, large system","s4q5option2":"It eliminates the need for standard protocols","s4q5option3":"It breaks down software into modular components that can evolve and scale independently","s4q5option4":"It simplifies data storage requirements","s4q6":"What is preventing legacy software architectures from addressing the needs of digitization?","s4q6option1":"Increasing data volume and lack of speed/agility","s4q6option2":"Software cost and integration cost","s4q6option3":"Legacy systems obsolescence and poor user interface","s4q6option4":"Lack of training and support","s4q7":"What is the main benefit of using platforms and microservices in software architecture?","s4q7option1":"Low cost of ownership","s4q7option2":"Increased autonomy","s4q7option3":"Evolution and scalability","s4q7option4":"Complex integration capabilities","s4q8":"Which assertion about digital professional services below is true?","s4q8option1":"They are less and less needed as new software architectures simplify integration","s4q8option2":"They are only needed for large companies and complex projects","s4q8option3":"They focus mainly on technical support","s4q8option4":"They are essential for strategizing, designing, and executing projects","s4q9":"What is the role of an operating system in a computer?","s4q9option1":"To create software applications faster by enabling the reuse of libraries of code","s4q9option2":"To facilitate the execution of applications by managing hardware resources sharing","s4q9option3":"To generate the binary code of an application","s4q9option4":"To provide power to the CPU","s4q10":"What is a Real-Time Operating System (RTOS)?","s4q10option1":"A system for real-time video processing","s4q10option2":"A system for database management","s4q10option3":"An operating system for general-purpose computing","s4q10option4":"A highly reliable operating system for precise-timing applications","s4q11":"What is an API?","s4q11option1":"A software layer that allows different software pieces to communicate and use each other's functions","s4q11option2":"An algorithm processor that speeds up computation","s4q11option3":"An application to secure personal information","s4q11option4":"An advanced power interface to optimize energy consumption","s4q12":"What type of software architecture is replacing big monolithic software systems?","s4q12option1":"Centralized architecture","s4q12option2":"Modular and microservice architectures","s4q12option3":"Cloud-based architectures","s4q12option4":"Hierarchical architectures","s4q13":"Which of the following assertions about Enterprise Sales below is false?","s4q13option1":"Enterprise sales have much longer sales cycles","s4q13option2":"Enterprise sales involve multiple stakeholders and decision-makers","s4q13option3":"Enterprise sales require more investment and effort from the sales team","s4q13option4":"Enterprise sales focus on deploying standard solutions at scale","s4q14":"Which option below is not a software sales model?","s4q14option1":"Self-service","s4q14option2":"Business To Consumer","s4q14option3":"Transactional","s4q14option4":"Enterprise","s4q15":"What are the 4 'D' stages of the Enterprise Sales model?","s4q15option1":"Diagnosis, Definition, Development, Delivery","s4q15option2":"Discovery, Data collection, Diagnosis, Development","s4q15option3":"Discovery, Diagnosis, Development, Delivery","s4q15option4":"Direction, Deal, Development, Deliverance","s4q16":"Which question will likely come after the others have been addressed in the Enterprise Sales model?","s4q16option1":"What is the cost of your system?","s4q16option2":"How will this system benefit my business?","s4q16option3":"What are the key advantages of using this system over current solutions?","s4q16option4":"Are there any case studies or success stories from similar businesses?","s4q17":"What is the main benefit of discussing an implementation blueprint in the Enterprise Sales model?","s4q17option1":"It identifies the partners needed to implement the system","s4q17option2":"It defines the codes and standards used in the implementation of the system","s4q17option3":"It creates the basis for a quotation","s4q17option4":"It lowers the perception of complexity and risk for the customer","s4q18":"What is IoT?","s4q18option1":"The concept of connecting everyday devices to the internet allowing them to communicate and exchange data","s4q18option2":"A system where different technologies are integrated into a single platform to streamline processes and reduce redundancy","s4q18option3":"A suite of online tools used to monitor and manage cloud-based systems and digital networks","s4q18option4":"A method for improving the efficiency of interconnected systems through advanced algorithms and analytics","s4q19":"Which assertion about open-source vs proprietary software below is true?","s4q19option1":"Open-source software is free to use, proprietary software requires a license or subscription to use","s4q19option2":"Open-source software is developed by private companies, proprietary software is developed by open communities","s4q19option3":"Open-source software allows users to access and modify the source code, proprietary software keeps the source code closed","s4q19option4":"Open-source software can only be used by non-profit organizations, proprietary software can be used by both businesses and individuals","s4q20":"What is a digital twin?","s4q20option1":"A backup copy of digital data stored in the cloud to prevent loss in case of hardware failure","s4q20option2":"A virtual representation of a physical object, system, or process that allows for simulation and analysis in real time","s4q20option3":"A software tool that creates identical copies of files for synchronization between multiple devices","s4q20option4":"A method of encrypting data to ensure it remains identical during transmission","s4q21":"Who has the largest market share in Industrial Software in 2025?","s4q21option1":"Siemens","s4q21option2":"SAP","s4q21option3":"IBM","s4q21option4":"Microsoft","s4q22":"Is the Environmental Data Program a label, similar to Green Premium?","s4q22option1":"Yes","s4q22option2":"No","s4q23":"Why is Schneider moving away from Green Premium? (SELECT ALL THAT APPLY)","s4q23option1":"Because of evolving regulations, framing how companies define sustainable products and how to communicate about their sustainability performance","s4q23option2":"Because our clients are asking more granular environmental data on the products they buy","s4q23option3":"Because Schneider wants to continue being a leader in responsible communication","s4q24":"What are the benefits of our Sustainability propositions for our customers? (SELECT ALL THAT APPLY)","s4q24option1":"Make fact-based decisions by leveraging reliable data","s4q24option2":"Differentiate their value propositions by opting for more sustainable products","s4q24option3":"Accurately evaluate and report on their environmental footprint and carbon emissions reduction efforts","s4q24option4":"Get a discount on more sustainable products","s4q24option5":"Support transparent and responsible marketing practices","s4q25":"What are the 5 categories of the Environmental Data Program?","s4q25option1":"Environmental footprint, Packaging, Materials, Energy efficiency, Recyclability","s4q25option2":"Carbon footprint, Product Environmental Profile, Substance compliance, Packaging, End of Life","s4q25option3":"Environmental footprint, Materials and substances, Energy efficiency, Lifetime extension, Repack and remanufacture","s4q26":"Where can you find the environmental data of the products? (SELECT ALL THAT APPLY)","s4q26option1":"The environmental attributes are currently available on se.com Product Detailed Pages","s4q26option2":"The environmental attributes will be available through MySchneider app in 2025","s4q26option3":"The environmental attributes will only be shared with our top partners and customers.","s4q27":"What are the two sides of our sustainability story? (SELECT ALL THAT APPLY)","s4q27option1":"Leading ESG by example in our ecosystem","s4q27option2":"Building the Schneider Sustainability Impacts (SSIs)","s4q27option3":"Being an impact company","s4q27option4":"Being the digital partner for Sustainability and Efficiency for our customers","s4q27option5":"Having a strong recognition of our commitment","s4q28":"What are the three steps towards making a company's activities low carbon? (Select all the right answers)","s4q28option1":"Digitize","s4q28option2":"Decarbonize","s4q28option3":"Measure","s4q28option4":"Strategize","s4q28option5":"Electrify","s4q29":"What are the two things you need to do before you talk sustainability with a customer? (Select all the right answers)","s4q29option1":"Understand their readiness level on the topic","s4q29option2":"Look up all regulations which apply to the customer","s4q29option3":"Understand their specific needs","s4q29option4":"Make sure sustainable solutions will not be more expensive","s4q30":"What share of Fortune 500 companies have set Science-Based targets for carbon emissions reduction?","s4q30option1":"2%","s4q30option2":"7%","s4q30option3":"16%","s4q30option4":"33%","s4q30option5":"59%","s4q31":"How does Schneider Electric help customers achieve their sustainability targets? Since we monitor client equipment 24x7, they may not have to replace their equipment - so they save on carbon footprint linked to buying new equipment. Thanks to condition based maintenance, Schneider Electric will send a Service Representative only when conditions require him/her on-site, saving on onsite travel footprint.","s4q31option1":"Since we monitor client equipment 24x7, they may not have to replace their equipment - so they save on carbon footprint linked to buying new equipment","s4q31option2":"Thanks to condition-based maintenance, SE will send a Service Representative only when conditions require him/her on-site, saving on onsite travel footprint","s4q31option3":"Neither 1 nor 2","s4q31option4":"Both 1 & 2","s4q32":"How do we deliver Exclusive level of support, on-site and remotely to EcoCare members? (SELECT ALL THAT APPLY)","s4q32option1":"Faster response times and SLA to emergency support","s4q32option2":"Customer Success Manager","s4q32option3":"Exclusive on-site services rep per site","s4q32option4":"Remote Monitoring and alarming by our Connected Services Hub Team","s4q32option5":"Level 2 Support from Customer Care Center","s4q32option6":"Access to mySchneider portal","s4q33":"Please complete this sentence by selecting the right option below: We enable maintenance activities optimization by postponing first maintenance to year 5 instead of year 3, thanks to Maintenance Index, which recommends when the maintenance is needed and which assets to maintain in priority. This is what we call _____________________","s4q33option1":"Reactive maintenance","s4q33option2":"Condition-based maintenance","s4q33option3":"Calendar-based maintenance","s4q34":"Our digital capabilities are a key driver for digital recurring services. Which are 4 indexes to monitor the health of the assets?","s4q34option1":"Health Index, Transformers Index, Partial Discharge Index and Maintenance Index","s4q34option2":"Health Index, Partial Discharge Index, Electrical Fire Index and Maintenance Index","s4q34option3":"Health Index, Partial Discharge Index, Electrical Fire Index and Monitoring Index","s4q35":"Which of the following is NOT true with respect to the Customer Success Manager Role?","s4q35option1":"Coaching the customer during the entire lifecycle of the contract","s4q35option2":"Follow up on every single activity that will be performed during the membership","s4q35option3":"Takes actions to add additional client assets to our EcoStruxure Digital platform","s4q35option4":"Analyze all analytics available on our platform and send client a report with insights & recommendations","s4q36":"What are the standards and practices in Cybersecurity & data protection followed by Schneider Electric that help avoid cybersecurity breaches for our customers? (SELECT ALL THAT APPLY)","s4q36option1":"Schneider Electric Gateway embeds advanced security with user authentication as well as strong password policy","s4q36option2":"Data is protected by encryption algorithms","s4q36option3":"We use only one way data transmission from client gateway to Schneider Electric platform","s4q36option4":"Hosted by Amazon Web Services that is state of the art in Cloud & protection","s4q37":"When our assets are natively connected to cloud based platform for 24x7 monitoring & smart alarming, what are potential benefits to our customers? (SELECT ALL THAT APPLY)","s4q37option1":"Increase in equipment / system uptime","s4q37option2":"Simplification of operations","s4q37option3":"Optimization of maintenance budget","s4q38":"Which of the following is true with respect to experts in the Connected Services Hub? (SELECT ALL THAT APPLY)","s4q38option1":"They provide consultancy to customers","s4q38option2":"They monitor sites 24x7","s4q38option3":"They will call customer if anything abnormal happens","s4q38option4":"They program the relationship with the customers","s5q1":"What are the most important things to do on your opportunity?","s5q1option1":"Ensure all of your known opportunities are on bFO","s5q1option2":"Always ensure that Opportunity Stage is reflective of the current status of the opportunity","s5q1option3":"Always ensure the close date is reflective of when you understand the opportunity will close","s5q1option4":"All of these options","s5q2":"One of your opportunities has been lost, you should (SELECT ALL THAT APPLY)","s5q2option1":"Close the opportunity as lost","s5q2option2":"Close the opportunity as lost, & capture competitor's information as they are key insights to understand","s5q2option3":"Close the opportunity as lost & if you don't know the competitor's information, complete 'Other' for the competitor's name & 'Unknown' for 'other name'","s5q3":"Which of the following can be achieved by following the sales process golden rules?","s5q3option1":"Pitfalls to influence a potential sale","s5q3option2":"Reliable data quality for BI tools","s5q4":"An existing customer told you that one of his company branches could be interested in Schneider products, you should (SELECT ALL THAT APPLY)","s5q4option1":"Create directly this new account","s5q4option2":"Check if the account already exists. As it doesn't exist, you create it with the contact related to it & add a follow-up date to call him","s5q4option3":"Create the relationship between the two accounts: the headquarter as the ultimate parent, the branch as its parent account","s5q5":"In order to collaborate on a same account with your colleagues, you can (SELECT ALL THAT APPLY)","s5q5option1":"Give access to this account to your colleagues by setting up an account team","s5q5option2":"Log as much information as possible on the bFO account of your customer. As bFO is a shared tool, they will be able to check them","s5q5option3":"Exchange information with your colleagues only by email","s5q6":"When managing an \"On-hold\" opportunity, which of these you should proactively update to keep the Opportunity in pipeline? (SELECT ALL THAT APPLY)","s5q6option1":"Chain Player","s5q6option2":"End User","s5q6option3":"Follow-up date","s5q6option4":"Forecast Category","s5q7":"What is the first step in the opportunity workflow?","s5q7option1":"Create a master project","s5q7option2":"Know if the business is one-time or repetitive","s5q7option3":"Create a frame Opportunity","s5q7option4":"Clone the object Opportunity as a Simple","s5q8":"At which 'Top 4 level' should Opportunity Line be created at to ensure most accurate EcoStruxure tagging?","s5q8option1":"Product Line","s5q8option2":"Product Family","s5q8option3":"Family","s5q9":"Where can the EcoStruxure bFO Referential mapping file be found?","s5q9option1":"Sales Corner","s5q9option2":"Schneider Electric Intel","s5q9option3":"GreenBerry+","s5q10":"What KPI found in the Digital Flywheel best indicates your scope's shift to EcoStruxure?","s5q10option1":"Orders (or Sales) Amount","s5q10option2":"Orders (or Sales) YoY Weight as a % of Total","s5q10option3":"Recurring Orders (or Sales) Amount","s5q10option4":"EcoStruxure Orders (or Sales) YoY growth","s5q11":"What 2 Business Models comprise Layer 3 of the Digital Flywheel?","s5q11option1":"Products & Systems","s5q11option2":"Systems & Services","s5q11option3":"Software & Services","s5q12":"What is the purpose of a Value Discovery Workshop (VDWS)?","s5q12option1":"VDWS is a consultative engagement driven by Segment Solutions Specialists to generate L2/L3 business opportunities","s5q12option2":"VDWS is an activity driven by EU sales to close a business deal","s5q12option3":"VDWS is a workshop to discuss a solution architecture","s5q12option4":"VDWS is an activity to uncover Customer Services needs","segmentSectionSummary":"Segment Section Summary","domainSectionSummary":"Domain Section Summary","softwareServicesSectionSummary":"Software, Services & Sustainability Section Summary","salesSkillsSectionSummary":"Sales Skills Section Summary","salesToolsSectionSummary":"Sales Tools & Processes Section Summary","questionsAttempted":"Questions Attempted: ","correctResponses":"Correct Responses: ","pointsValue":"Point Values: ","pointsNote":"Note: Some questions in this section were weighted, with answers assigned different point values. The more points you scored, the higher your percentage result.","segmentTitle":"Segment","segmentDescsecond1":"The overarching knowledge of C&SP (Colocation) segment is key to the success of your role as it helps you uncover your customers' business and how we, at Schneider Electric, can help them.","segmentDescsecond2":"The questions in this section will focus across EcoStruxure Power,\nBuilding and IT (Data Centre) offer overview, key customer\nquestions and persona benefits.","softwareTitle":"Software, Services & Sustainability","segmentDesc1":"The overarching knowledge of C&SP (Colocation) segment is key to the success of your role as it helps you uncover your customers' business and how we, at Schneider Electric, can help them.","segmentDesc2":"The questions in this section would explore:","segmentPoints":["Our segment customers' business, industry trends, and value chain players.","Segment Value proposition, key differentiating points of our main offers and EcoStruxure architecture.","Better understanding of how to engage customers into value-driven interaction to jointly quantify the impact of Schneider Electric Solutions."],"badgeAlt":"Achievement badge","congratsText":"Congratulations! You have passed the assessment","message1":"<p>Your hard work and dedication have paid off. Your scorecard PDF and LMS transcript has been updated with your results and suggested learnings. Keep up the great work!</p><p>You are now officially on your way to earn your End User Seller Associate Level Certification. You will receive a mail with further info and next steps.</p>","message2":"<p>Thank you for taking the time to complete the assessment. You will need to retake the assessment in the sections where you scored less than 65%.</p><p>Retake options will be available from the 14th February onwards.</p><p>Meanwhile, we have handpicked trainings that will help you succeed in the assessment retakes. These trainings will be assigned and available for you to take on My Learning Link.</p>","buttonText":"Download your scorecard ","contactText":"If you have any further questions, email us at ","emailAddress":"commercial.excellence.academy@se.com","failText":"You did not pass the assessment!","finalResult2Text1":"Thank you taking the time to complete the assessment. You will need to retake the assessment in the sections where you scored less than 65%. ","finalResult2Text2":"<b>Details related to retake will be communicated to you via email..</b> ","finalResult2Text3":"Meanwhile we have handpicked trainings that will help you succeed in the assessment retakes. These trainings will be assigned and available for you to take on My Learning Link..","timerText":"{days} left to complete <br/> your trainings and retake","finalResult3Text1":"↺ Retake the assessment ({current}/{total} attempts left)","confirmationTitle":"Are you sure?","confirmationMessage":"You have only {current} more attempts to pass the baseline assessment. Make sure that you have completed your training path.","cancel":"Cancel","start":"Start","retake":"Retake","exit":"Exit Course","youPassed":"You passed this section!","youFailed":"You failed this section!","youFailed1":"Passing Score : {passing}%","cspSegmentValue":"Which of the below describes the value proposition of the C&SP Segment?","test":"Test"}